<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"951e4fc3ef530e705caf2fb9876edded3042e48c82d90940faa62c0c1dd43788","plan_job_ref":"Job Pull Request Checks #4734 at https://github.com/GSA-TTS/FAC/actions/runs/14645765460","plan_out_hash":"1bb68d541a9db5a8852f36938c9fa6bf5d2212a7fd9fa5e064d34a37fb0b4c7f","plan_hash":"6444c3efb660d54462051a4ea005dc7741456cd371cba909e2080e0ae94e32c8","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 3 to add, 11 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.production.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
        id = "41e96938-1383-c2ce-3157-af85063feaa3"

-       policy {
-           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284"
        }

#        (2 unchanged blocks hidden)
    }

  # module.production.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
        id = "bffa4f44-73e2-295d-6c7e-2809a21406d6"

-       policy {
-           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> null
        }
-       policy {
-           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "99ba1218-5b6e-42fc-9484-00eebde48eda"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb"
        }
    }

  # module.production.cloudfoundry_network_policy.logshipper-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "logshipper-network-policy" {
        id = "63155665-aac2-9f9d-6c0f-c98cdcec4047"

-       policy {
-           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "85f6e332-8ef0-4fa1-bcc4-ba5803231358" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.production.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
        id = "65fbd285-0a4b-cfbe-3445-d40cc279c621"

-       policy {
-           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "c7d5a4a2-5eca-46e5-81f0-315381c5b873" -> null
        }
-       policy {
-           destination_app = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "c7d5a4a2-5eca-46e5-81f0-315381c5b873" -> null
        }
+       policy {
+           destination_app = "99ba1218-5b6e-42fc-9484-00eebde48eda"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.production.module.cg-logshipper.cloudfoundry_app.logshipper_app will be updated in-place
!~  resource "cloudfoundry_app" "logshipper_app" {
!~      created_at                  = "2025-04-21T20:52:46Z" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "logshipper"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-production-logshipper.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "e4e9e942a857c76a4792c6b18bcbee83cbcabc2c89084fc3a0a1cb94fb4d15e2" -> "3de51d5be398426d06e6c738d964af3c631a368a1dcd68a58dc8212c56c5b9b9"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-04-22T00:22:30Z" -> (known after apply)
#        (12 unchanged attributes hidden)
    }

  # module.production.module.cg-logshipper.cloudfoundry_route.logshipper_route will be updated in-place
!~  resource "cloudfoundry_route" "logshipper_route" {
!~      destinations = [
-           {
-               app_id           = "85f6e332-8ef0-4fa1-bcc4-ba5803231358" -> null
-               app_process_type = "web" -> null
-               id               = "92e80372-ae8a-4f64-86e4-11727a2d766d" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "bac6e24a-a79d-48d6-b96e-05fee20c0539"
!~      updated_at   = "2025-04-21T20:53:39Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.production.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-04-22T00:12:40Z" -> (known after apply)
        }
    }

  # module.production.module.fac-file-scanner.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.production.module.fac-file-scanner.data.external.scannerzip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "scannerzip" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "prepare-scanner.sh",
        ]
+       query       = {
+           "gitref" = "refs/heads/main"
        }
+       result      = (known after apply)
+       working_dir = "../shared/modules/scanner"
    }

  # module.production.module.fac-file-scanner.cloudfoundry_app.scanner_app will be updated in-place
!~  resource "cloudfoundry_app" "scanner_app" {
!~      created_at                  = "2025-04-21T20:53:41Z" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "fac-file-scanner"
!~      path                        = "../shared/modules/scanner/scanner.zip" -> (known after apply)
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-file-scanner-production.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "71923e775835e1624482408259d149086ce0d791f9b4ac2f167391b493ceed53" -> (known after apply)
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-04-21T23:21:58Z" -> (known after apply)
#        (11 unchanged attributes hidden)
    }

  # module.production.module.fac-file-scanner.cloudfoundry_route.scanner_route must be replaced
-/+ resource "cloudfoundry_route" "scanner_route" {
!~      created_at   = "2025-04-22T00:13:12Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "c7d5a4a2-5eca-46e5-81f0-315381c5b873" -> null
-               app_process_type = "web" -> null
-               id               = "647955ff-7e71-48eb-8b29-bef571488671" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      updated_at   = "2025-04-22T00:13:12Z" -> (known after apply)
!~      url          = "fac-file-scanner-production.apps.internal" -> (known after apply)
#        (2 unchanged attributes hidden)
    }

  # module.production.module.https-proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2025-04-21T20:52:29Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "https-proxy"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "gsa-tts-oros-fac-production-egress-https-proxy.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "175a3a43404fb2a33deaf8fba9e461a196ec830fb1991f4dffac53a6504ffcc8" -> "b484469dcfb5672a2891b928bf55728283205ede65f1c1322f0514d2eecae40b"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-04-22T00:22:21Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.production.module.https-proxy.cloudfoundry_route.egress_route will be updated in-place
!~  resource "cloudfoundry_route" "egress_route" {
!~      destinations = [
-           {
-               app_id           = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-               app_process_type = "web" -> null
-               id               = "301409a5-a526-4295-a5bc-434d89b7b4c2" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "456570fe-c30a-4ed5-a2ef-ab3f768e617a"
!~      updated_at   = "2025-04-21T20:52:46Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.production.module.newrelic.newrelic_notification_destination.email_destination will be updated in-place
!~  resource "newrelic_notification_destination" "email_destination" {
        id         = "e7c0bf9e-3e32-454e-98e6-40aa0694adbc"
        name       = "email_destination"
#        (6 unchanged attributes hidden)

-       property {
-           key           = "email" -> null
-           value         = "daniel.swick@gsa.gov, matthew.jadud@gsa.gov, alexander.steel@gsa.gov" -> null
#            (2 unchanged attributes hidden)
        }
-       property {
-           key           = "source" -> null
-           label         = "terraform-source-internal" -> null
-           value         = "terraform" -> null
#            (1 unchanged attribute hidden)
        }
+       property {
+           key           = "email"
+           value         = "matthew.jadud@gsa.gov, alexander.steel@gsa.gov"
#            (2 unchanged attributes hidden)
        }
+       property {
+           key   = "source"
+           label = "terraform-source-internal"
+           value = "terraform"
        }
    }

  # module.production.module.fac-file-scanner.module.quarantine.data.cloudfoundry_service_plans.s3 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_service_plans" "s3" {
+       name                  = "basic"
+       service_offering_name = "s3"
+       service_plans         = (known after apply)
    }

  # module.production.module.fac-file-scanner.module.quarantine.cloudfoundry_service_instance.bucket will be updated in-place
!~  resource "cloudfoundry_service_instance" "bucket" {
+       dashboard_url     = (known after apply)
        id                = "ca564d14-b89a-4944-a43f-033dca62ab30"
!~      last_operation    = {
!~          created_at  = "2025-03-14T15:36:40Z" -> (known after apply)
+           description = (known after apply)
!~          state       = "succeeded" -> (known after apply)
!~          type        = "update" -> (known after apply)
!~          updated_at  = "2025-03-14T15:36:40Z" -> (known after apply)
        } -> (known after apply)
!~      maintenance_info  = {
+           description = (known after apply)
+           version     = (known after apply)
        } -> (known after apply)
        name              = "fac-file-scanner-quarantine"
!~      service_plan      = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806" -> (known after apply)
        tags              = [
            "s3",
            "terraform-cloudgov-managed",
        ]
!~      updated_at        = "2025-03-14T15:36:40Z" -> (known after apply)
!~      upgrade_available = false -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # module.production.module.file_scanner_clamav.module.route.data.cloudfoundry_domain.domain will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "domain" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.production.module.file_scanner_clamav.module.route.data.cloudfoundry_org.org will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_org" "org" {
+       annotations = (known after apply)
+       created_at  = (known after apply)
+       id          = (known after apply)
+       labels      = (known after apply)
+       name        = "gsa-tts-oros-fac"
+       quota       = (known after apply)
+       suspended   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.production.module.file_scanner_clamav.module.route.data.cloudfoundry_space.space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "space" {
+       allow_ssh         = (known after apply)
+       annotations       = (known after apply)
+       created_at        = (known after apply)
+       id                = (known after apply)
+       isolation_segment = (known after apply)
+       labels            = (known after apply)
+       name              = "production"
+       org               = (known after apply)
+       quota             = (known after apply)
+       updated_at        = (known after apply)
    }

  # module.production.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route must be replaced
-/+ resource "cloudfoundry_route" "app_route" {
!~      created_at   = "2025-04-22T00:13:12Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> null
-               app_process_type = "web" -> null
-               id               = "33711cf8-a72d-46a4-aac4-2dfb6a63ee1a" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = "************************************"
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      space        = "5593dba8-7023-49a5-bdbe-e809fe23edf9" -> (known after apply) # forces replacement
!~      updated_at   = "2025-04-22T00:13:12Z" -> (known after apply)
!~      url          = "fac-av-production-fs.apps.internal" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

Plan: 3 to add, 11 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4734](https://github.com/GSA-TTS/FAC/actions/runs/14645765460)